In [1]:
import pandas as pd

# two main data structures, pandas series and pandas dataframe

In [2]:
groceries= pd.Series(data=[30, 6, 'Yes', 'No'], index=['eggs', 'apples', 'milk', 'bread'])
# one dimensional array-like object that can hold different datatypes
# can assign an index label to panda series
groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [10]:
print(groceries.shape)
print(groceries.ndim)
print(groceries.size)
print(groceries.index)
print(groceries.values)

(4,)
1
4
Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')
[30 6 'Yes' 'No']

In [11]:
# check whether index label exists
print('banana' in groceries)
print('bread' in groceries)

False
True

In [16]:
# accessing and modifying the elements
print(groceries['eggs'])
print()
print(groceries[['milk','bread']])
print()
print(groceries[0])
print()
print(groceries[-1])
print()
print(groceries[[0,1]])

30

milk     Yes
bread     No
dtype: object

30

No

eggs      30
apples     6
dtype: object

In [19]:
# loc and iloc
print(groceries.loc[['eggs','apples']]) # location, explicitly state using labeled index
print()
print(groceries.iloc[[2,3]]) # explicitly state using numerical index

eggs      30
apples     6
dtype: object

milk     Yes
bread     No
dtype: object

In [23]:
# changing elements
groceries['eggs'] = 20
print(groceries.drop('apples')) # drops series out of place -> doesn't change original series
print()
print(groceries)
print()
groceries.drop('apples', inplace=True)
print(groceries)

eggs      20
milk     Yes
bread     No
dtype: object

eggs       20
apples      6
milk      Yes
bread      No
dtype: object

eggs      20
milk     Yes
bread     No
dtype: object

In [25]:
# performing arithmatic functions
fruits= pd.Series(data = [10, 6, 3,], index = ['apples', 'oranges', 'bananas'])

print(fruits+2)
print()
print(fruits-2)
print()
print(fruits*2)
print()
print(fruits/2)
print()

apples     12
oranges     8
bananas     5
dtype: int64

apples     8
oranges    4
bananas    1
dtype: int64

apples     20
oranges    12
bananas     6
dtype: int64

apples     5.0
oranges    3.0
bananas    1.5
dtype: float64

In [28]:
# numpy arithmatic functions can be applied to pandas objects
import numpy as np
print(np.sqrt(fruits))
print()
print(np.exp(fruits))
print()
print(np.power(fruits,2))

apples     3.162278
oranges    2.449490
bananas    1.732051
dtype: float64

apples     22026.465795
oranges      403.428793
bananas       20.085537
dtype: float64

apples     100
oranges     36
bananas      9
dtype: int64

In [30]:
# perform functions on selective data from series
print(fruits['bananas'] + 2)
print()
print(fruits.iloc[0] - 2)
print()
print(fruits[['apples','oranges']] * 2)
print()
print(fruits.loc[['apples','oranges']]/ 2)

5

8

apples     20
oranges    12
dtype: int64

apples     5.0
oranges    3.0
dtype: float64

In [32]:
# can perform arithmatic functions on multiple datatypes as long as the types support the operation
print(groceries * 2)
# division of strings will throw error

eggs         40
milk     YesYes
bread      NoNo
dtype: object

In [33]:
# example of boolean indexing
distance_from_sun = [149.6, 1433.5, 227.9, 108.2, 778.6]

planets = ['Earth','Saturn', 'Mars','Venus', 'Jupiter']

# Create a Pandas Series using the above data, with the name of the planets as
# the index and the distance from the Sun as your data.
dist_planets = pd.Series(data=distance_from_sun, index=planets)

# Calculate the number of minutes it takes sunlight to reach each planet. You can
# do this by dividing the distance from the Sun for each planet by the speed of light.
# Since in the data above the distance from the Sun is in units of 10^6 km, you can
# use a value for the speed of light of c = 18, since light travels 18 x 10^6 km/minute.
time_light = dist_planets / 18

# Use Boolean indexing to select only those planets for which sunlight takes less
# than 40 minutes to reach them.
close_planets = time_light[time_light < 40]
print(close_planets)

Earth     8.311111
Mars     12.661111
Venus     6.011111
dtype: float64

In [36]:
# think of dataframe as a powerful spreadsheet

# We create a dictionary of Pandas Series 
items = {'Bob' : pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
         'Alice' : pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}

# We print the type of items to see that it is a dictionary
print(type(items))

<class 'dict'>

In [38]:
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [39]:
# pandas will automatically index the rows if labels aren't provided
data = {'Bob' : pd.Series(data = [245, 25, 55]),
         'Alice' : pd.Series(data = [40, 110, 500, 45])}
carts = pd.DataFrame(data)
carts

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [42]:
# dataframe attributes
print(shopping_carts.index)
print()
print(shopping_carts.columns)
print()
print(shopping_carts.values)
print()
print(shopping_carts.shape)
print()
print(shopping_carts.ndim)
print()
print(shopping_carts.size)

Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

Index(['Bob', 'Alice'], dtype='object')

[[245. 500.]
 [ nan  40.]
 [ nan 110.]
 [ 25.  45.]
 [ 55.  nan]]

(5, 2)

2

10

In [60]:
# selecting data
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])
print(bob_shopping_cart)
print()
# items for both Alice and Bob
sel_shopping_cart = pd.DataFrame(items, index=['pants', 'book'])
print(sel_shopping_cart)

       Bob
bike   245
pants   25
watch   55

        Bob  Alice
pants  25.0     45
book    NaN     40

In [61]:
# creating a dataframe from scratch
# create a dictionary of lists (arrays)
data = {'Integers' : [1,2,3],
        'Floats' : [4.5, 8.2, 9.6]}

# create a DataFrame and provide the row index
df = pd.DataFrame(data, index = ['label 1', 'label 2', 'label 3'])

print(df)
print()

# create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

# create a DataFrame and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2'])

print(store_items)

         Integers  Floats
label 1         1     4.5
label 2         2     8.2
label 3         3     9.6

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

In [62]:
# can access elements of dataframe using rows and cols
print(store_items[['bikes','pants']])
print()
print(store_items.loc[['store 1']])
print()
print(store_items['bikes']['store 2'])
print()

# adding data
store_items['shirts'] = [15, 2]
print(store_items)
print()

# add columns using arithmatic operations
store_items['suits'] = store_items['pants'] + store_items['shirts']
print(store_items)
print()

         bikes  pants
store 1     20     30
store 2     15      5

         bikes  glasses  pants  watches
store 1     20      NaN     30       35

15

         bikes  glasses  pants  watches  shirts
store 1     20      NaN     30       35      15
store 2     15     50.0      5       10       2

         bikes  glasses  pants  watches  shirts  suits
store 1     20      NaN     30       35      15     45
store 2     15     50.0      5       10       2      7

In [63]:
# adding rows
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]
new_store = pd.DataFrame(new_items, index = ['store 3'])
print(new_store)
print()

store_items = store_items.append(new_store, sort=True)
store_items

         bikes  glasses  pants  watches
store 3     20        4     30       35

         bikes  glasses  pants  shirts  suits  watches
store 1     20      NaN     30    15.0   45.0       35
store 2     15     50.0      5     2.0    7.0       10
store 3     20      4.0     30     NaN    NaN       35

In [64]:
# add a column with only a subset of rows
store_items['new_watches'] = store_items['watches'][1:]
store_items

         bikes  glasses  pants  shirts  suits  watches  new_watches
store 1     20      NaN     30    15.0   45.0       35          NaN
store 2     15     50.0      5     2.0    7.0       10         10.0
store 3     20      4.0     30     NaN    NaN       35         35.0

In [65]:
# insert explicitly -> shoes in the 5th column with values 8, 5, 0
store_items.insert(5, 'shoes', [8,5,0])
store_items

         bikes  glasses  pants  shirts  suits  shoes  watches  new_watches
store 1     20      NaN     30    15.0   45.0      8       35          NaN
store 2     15     50.0      5     2.0    7.0      5       10         10.0
store 3     20      4.0     30     NaN    NaN      0       35         35.0

In [66]:
# deleting data -> drop -> axis=1 means deleting a column
store_items = store_items.drop(['watches', 'shoes'], axis=1)
store_items

         bikes  glasses  pants  shirts  suits  new_watches
store 1     20      NaN     30    15.0   45.0          NaN
store 2     15     50.0      5     2.0    7.0         10.0
store 3     20      4.0     30     NaN    NaN         35.0

In [67]:
# delete a row by specifying axis=0
store_items = store_items.drop(['store 1', 'store 2'], axis=0)
store_items

         bikes  glasses  pants  shirts  suits  new_watches
store 3     20      4.0     30     NaN    NaN         35.0

In [68]:
# renaming columns
store_items = store_items.rename(columns={'bikes':'hats'})
store_items

         hats  glasses  pants  shirts  suits  new_watches
store 3    20      4.0     30     NaN    NaN         35.0

In [69]:
# renaming rows
store_items = store_items.rename(index={'store 3':'last store'})
store_items

            hats  glasses  pants  shirts  suits  new_watches
last store    20      4.0     30     NaN    NaN         35.0

In [70]:
# setting index explicitly
store_items = store_items.set_index('pants')
store_items

       hats  glasses  shirts  suits  new_watches
pants
30       20      4.0     NaN    NaN         35.0

In [142]:
# cleaning data -> getting rid of NaN (not a number) values
# create a list of Python dictionaries
def get_df():
    items = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
             {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

    # create a DataFrame and provide the row index
    store_items = pd.DataFrame(items, index = ['store 1', 'store 2'])
    store_items['shirts'] = [15, 2]
    store_items['suits'] = store_items['pants'] + store_items['shirts']
    
    new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]
    new_store = pd.DataFrame(new_items, index = ['store 3'])
    store_items = store_items.append(new_store, sort=True)
    
    store_items['new_watches'] = store_items['watches'][1:]
    store_items.insert(5, 'shoes', [8,5,0])
    return store_items

store_items = get_df()
print(store_items)
x = store_items.isnull()
x

         bikes  glasses  pants  shirts  suits  shoes  watches  new_watches
store 1     20      NaN     30    15.0   45.0      8       35          NaN
store 2     15     50.0      5     2.0    7.0      5       10         10.0
store 3     20      4.0     30     NaN    NaN      0       35         35.0

         bikes  glasses  pants  shirts  suits  shoes  watches  new_watches
store 1  False     True  False   False  False  False    False         True
store 2  False    False  False   False  False  False    False        False
store 3  False    False  False    True   True  False    False        False

In [143]:
x = store_items.isnull().sum()
x

bikes          0
glasses        1
pants          0
shirts         1
suits          1
shoes          0
watches        0
new_watches    1
dtype: int64

In [144]:
x = store_items.isnull().sum().sum()
x

4

In [145]:
store_items.count()

bikes          3
glasses        2
pants          3
shirts         2
suits          2
shoes          3
watches        3
new_watches    2
dtype: int64

In [146]:
# drop rows with NaN values
store_items.dropna(axis=0, inplace=True)
# drop col with NaN values
store_items.dropna(axis=1, inplace=True)
store_items

         bikes  glasses  pants  shirts  suits  shoes  watches  new_watches
store 2     15     50.0      5     2.0    7.0      5       10         10.0

In [147]:
# fill NaN cells with specified value -> in this case 0
store_items = get_df()
store_items.fillna(0)

         bikes  glasses  pants  shirts  suits  shoes  watches  new_watches
store 1     20      0.0     30    15.0   45.0      8       35          0.0
store 2     15     50.0      5     2.0    7.0      5       10         10.0
store 3     20      4.0     30     0.0    0.0      0       35         35.0

In [152]:
# fill NaN cells with values from previous entry
# backfill replaces with the next entry instead of previous entry
# change axis=1 to replace by prev/next value in the row
store_items = get_df()
store_items = store_items.fillna(method='ffill',axis=0)
store_items

         bikes  glasses  pants  shirts  suits  shoes  watches  new_watches
store 1     20      NaN     30    15.0   45.0      8       35          NaN
store 2     15     50.0      5     2.0    7.0      5       10         10.0
store 3     20      4.0     30     2.0    7.0      0       35         35.0

In [154]:
# replace NaN with interpolate methods
store_items = get_df()
print(store_items)
store_items = store_items.interpolate(method='linear', axis=1)
store_items

         bikes  glasses  pants  shirts  suits  shoes  watches  new_watches
store 1     20      NaN     30    15.0   45.0      8       35          NaN
store 2     15     50.0      5     2.0    7.0      5       10         10.0
store 3     20      4.0     30     NaN    NaN      0       35         35.0

         bikes  glasses  pants  shirts  suits  shoes  watches  new_watches
store 1   20.0     25.0   30.0    15.0   45.0    8.0     35.0         35.0
store 2   15.0     50.0    5.0     2.0    7.0    5.0     10.0         10.0
store 3   20.0      4.0   30.0    20.0   10.0    0.0     35.0         35.0

In [108]:
# example code of calculating preceding means for each row
# useful for sports data
df = pd.DataFrame(np.arange(1,41).reshape(10,4))
averages = []
for i in range(len(df)):
    averages.append(df.iloc[:i,3].mean())
df['col1_avg'] = averages
df

    0   1   2   3  col1_avg
0   1   2   3   4       NaN
1   5   6   7   8       4.0
2   9  10  11  12       6.0
3  13  14  15  16       8.0
4  17  18  19  20      10.0
5  21  22  23  24      12.0
6  25  26  27  28      14.0
7  29  30  31  32      16.0
8  33  34  35  36      18.0
9  37  38  39  40      20.0